Revit 2027 API
FilterDoubleRule Methods
The FilterDoubleRule type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from FilterRule)
ElementPasses |  Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
(Inherited from FilterRule)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEvaluator |  Gets the evaluator that implements the test for this rule.
(Inherited from FilterNumericValueRule)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRuleParameter |  Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
(Inherited from FilterRule)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEvaluator |  Sets the evaluator that implements the test for this rule.
(Inherited from FilterNumericValueRule)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FilterDoubleRule Class
Autodesk.Revit.DB Namespace